<template>
    <svg t="1730356570309" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
        p-id="1640" width="20" height="20" style="margin-right: 8px">
        <path
            d="M85.333333 0v938.666667h938.666667v85.333333H0V0h85.333333z m768 512a170.666667 170.666667 0 1 1 0 341.333333 170.666667 170.666667 0 0 1 0-341.333333zM405.333333 640a64 64 0 1 1 0 128 64 64 0 0 1 0-128z m-128-341.333333a106.666667 106.666667 0 1 1 0 213.333333 106.666667 106.666667 0 0 1 0-213.333333z m298.666667 85.333333a64 64 0 1 1 0 128 64 64 0 0 1 0-128z m256-213.333333a64 64 0 1 1 0 128 64 64 0 0 1 0-128z m-597.333333-85.333334a64 64 0 1 1 0 128 64 64 0 0 1 0-128z m298.666666 0a64 64 0 1 1 0 128 64 64 0 0 1 0-128z"
            p-id="1641"></path>
    </svg>
</template>

<script>
export default {
    name: 'MyIcon',
};
</script>

<style scoped>
.icon {
    fill: currentColor;
    /* 使用 currentColor 来允许颜色继承 */
}
</style>